package days02;

public class Ex05_07 {

	public static void main(String[] args) {
		/*
		 * [진법변환]
		 * 10진법 : 0 1 2 3 4 5 6 7 8 9 
		 * 2진법 : 0 1
		 * */
		/*
		 * [음수 표현 방법]
		 * 1. 부호와 절대치
		 * 2. 1의 보수법
		 * 3. (현재) 2의 보수법
		 * */
		 //byte b = -10;
		 //[0][0][0][0]	[0][0][0][0]
		 //[0][0][0][0]	[0][0][0][0]
		 
		 
		  //[-10]
		 //10
		 //0000 1010    2진법으로 변환
		 //1111 0101		1의보수 적용
		 //			   +1		2의 보수 적용
		 //-------------
		 //1111 0110
		 
		 /*
		  * 
		  * 
		  * */
		 
		 //[문제] 어떤 음수가 2의 보수법 저장 :  1010 1010
		 //						음수 얼마?
	

	}

}
